//  // =======Задача 7.1
//  alert(60*60*24);
//  // =======Задача 7.2
//  alert(60*60*24*30);
//  // =======Задача 7.3
//  alert(60*60*24*365);
//  // =======Задача 7.4
//  alert(60*24);
//  // =======Задача 7.5
//  alert(60*24*365);
//  // =======Задача 7.6
//  1048576 байт
//  // =======Задача 7.7
//  1073741824 байт
//  // =======Задача 7.8
//  10737418240 байт
//  // =======Задача 7.9
//  109951162777 байт
//  // =======Задача 7.10
//  1073741824 килобайт
//  // =======Задача 7.11
//  let r = 20;
//  let s = r * r * 3.1415;
//  alert(s);
//  // =======Задача 7.12
//  let a = 35;
//  let s = a * a;
//  alert(s);
//  // =======Задача 7.13
//  let a = 20;
//  let b = 30;
//  let s = a * b;
//  alert(s);
//  // =======Задача 7.14
//  let a = 50;
//  let b = 60;
//  alert(p = 2*(a + b));
//  // =======Задача 7.15
//  let tc = 36;
//  alert(tc*1.8+32);
//  // =======Задача 7.16
//  let tf = 200;
//  alert((tf-32)/1.8);
 
 