// // "use strict";

// // =======Задача 65.1
// let arr = [
// 	['a', 'b', 'c'],
// 	['d', 'e', 'f'],
// 	['g', 'h', 'i'],
// 	['j', 'k', 'l'],
// ];
// console.log(arr[3][2], arr[1][1], arr[2][0], arr[0][0]);

// // =======Задача 65.2
// let arr = [
//     [1, 2], 
//     [3, 4], 
//     [5, 6],
//     ];
    
//     let arr1 = arr[0][0] + arr[0][1];
//     let arr2 = arr[1][0] + arr[1][1];
//     let arr3 = arr[2][0] + arr[2][1];
//     console.log(arr1 + arr2 + arr3);

// // =======Задача 65.3
// let arr = [
// [
//  [1, 2],
//  [3, 4],
// ],
// [
//  [5, 6],
//  [7, 8],
// ],
// ];

// let arr1 = arr[0][0][0] + arr[0][0][1] + arr[0][1][0] + arr[0][1][1];
// let arr2 = arr[1][0][0] + arr[1][0][1] + arr[1][1][0] + arr[1][1][1];

// console.log(arr1 + arr2);

// // =======Задача 65.4
// let arr = [
//     [1, 2, 3, [4, 5, [6, 7]]], 
    
//     [8, [9, 10]]
//     ];
    
//     console.log(arr[0][0] + arr[0][1] + arr[0][2] + arr[0][3][0] + arr[0][3][1] + arr[0][3][2][0] + arr[0][3][2][1] + arr[1][0] + arr[1][1][0] + arr[1][1][1]);
