// "use strict";

// //=======Задача 21.1
// let test = 5;
// if(test > 10){
//     alert('верно');
//     }else{
//         alert('не верно');
//     }

// //=======Задача 21.2
// let test = 5;
// if(test < 10){
//     alert('верно');
//     }else{
//         alert('не верно');
//     }

// //=======Задача 21.3
// let test = 10;
// if(test >= 10){
//     alert('верно');
//     }else{
//         alert('не верно');
//     }

// //=======Задача 21.4
// let test = 10;
// if(test >= 10){
//     alert('верно');
//     }else{
//         alert('не верно');
//     }

// //=======Задача 21.5
// let test = 11;
// if(test == 10){
//     alert('верно');
//     }else{
//         alert('не верно');
//     }

// //=======Задача 21.6
// let test = 10;
// if(test != 10){
//     alert('верно');
// }else{
//     alert('неверно');
// }

// //=======Задача 21.7
// let test1 = 100; 
// let test2 = 200;
// if(test1 > test2){
//  alert('переменная test1 больше переменной test2');
// }else{alert('переменная test2 больше переменной test1');
// }