// "use strict";

// //=======Задача 15.1
// let age = prompt('Какой ваш возраст?');
// alert(age);

// //=======Задача 15.2
// let num1 = prompt('Введите первое число');
// let num2 = prompt('Введите второе число');
// alert(Number(num1) + Number(num2));

// //=======Задача 15.3
// let ask = prompt('Какая длинна стороны квадрата');
// alert('Площадь квадрата: ' + ask * ask);

// //=======Задача 15.4
// let num1 = prompt('Какая сторона прямоугольника номер 1?');
// let num2 = prompt('Какая сторона прямоугольника номер 2?');
// alert('Периметр введенного прямоугольника: ' + (Number(num1) + Number(num2))*2);
