// "use strict";

// //=======Задача 23.1
// let num = 150;
// if(num > 0 && num < 5){
//     alert('верно');
// }else{
//     alert('неверно');
// }

// //=======Задача 23.2
// let num = 30;
// if(num >= 20){
//     alert('верно');
// }else{
//     alert('неверно');
// }

// //=======Задача 23.3
// let num1 = 50;
// let num2 = 10;
// if(num1 <= 1 && num2 >=3){
// alert( 'верно');
// }else{
//     alert( 'неверно');
// }

// //=======Задача 23.4
// неверно

// //=======Задача 23.5
// верно

// //=======Задача 23.6
// верно

// //=======Задача 23.7
// верно

// //=======Задача 23.8
// верно

// //=======Задача 23.9
// верно

// //=======Задача 23.10
// неверно

// //=======Задача 23.11
// верно

// //=======Задача 23.12
// let num = 3;		
// if (num > 5 && (num < 10 || num == 20)) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

// //=======Задача 23.13
// let num = 3;
		
// if ((num > 5 || num > 0) && (num < 3)) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

// //=======Задача 23.14
// let num = 3;
		
// if ((num == 9 || num > 10) &&( num < 20 || num > 20) && (num < 30)) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }