// "use strict";

// //=======Задача 40.1
// let arr = ['a', 'b', 'c', 'd', 'e'];
// for(let elem of arr){
// console.log(elem);
// }

// //=======Задача 40.2
// let arr = [1, 2, 3, 4, 5];
// for(let num of arr){
// console.log(num);
// }

// //=======Задача 40.3
// let arr = ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь'];
// for(let elem of arr){
// console.log(elem);
// }
// //=======Задача 40.4
// //Много времени пошло на эту задачу. Считает с нуля. Из за этого не корректно работает. Не получилось сделать.
// let m = 3;
// let arr = ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь'];
// for(let i=0; i<arr.length; i++){
// arr.splice(m, 1, arr[m].italics());
// document.write(arr[i] + ' ,'+'<p>');
// }

