// "use strict";

// //=======Задача 25.1
// let test = true;
// if(test === true){
//     alert('верно');
// }else{
//     alert('неверно');
// }

// //=======Задача 25.2
// let test = false;
// if(test === false){
//     alert('верно');
// }else{
//     alert('неверно');
// }

// //=======Задача 25.3
// верно

// //=======Задача 25.4
// неверно

// //=======Задача 25.5
// неверно

// //=======Задача 25.6
// неверно

// //=======Задача 25.7
// неверно

// //=======Задача 25.8
// неверно

// //=======Задача 25.9
// верно

// //=======Задача 25.10
// неверно

// //=======Задача 25.11
// неверно

// //=======Задача 25.12
// let test = true;

// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

// //=======Задача 25.13
// let test = true;

// if (!test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }
// //=======Задача 25.14
// let test = true;

// if (!test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

// //=======Задача 25.15
// let test = true;

// if (test) {
// 	alert('верно');
// } else {
// 	alert('неверно');
// }

// //=======Задача 25.16
// верно

// //=======Задача 25.17
// верно

// //=======Задача 25.18
// неверно

// //=======Задача 25.19
// неверно

// //=======Задача 25.20
// неверно

// //=======Задача 25.21
// неверно

// //=======Задача 25.22
// неверно

// //=======Задача 25.23
// неверно

// //=======Задача 25.24
// верно

// //=======Задача 25.25
// верно
