// // "use strict";

// // =======Задача 11.1
// true
// // =======Задача 11.2
// false
// // =======Задача 11.3
// true
// // =======Задача 11.4
// false
// // =======Задача 11.5
// false
// // =======Задача 11.6
// true
// // =======Задача 11.7
// false
// // =======Задача 11.8
// true
// // =======Задача 11.9
// true
// // =======Задача 11.10
// false       
// // =======Задача 11.11
// true
// // =======Задача 11.12
// true
// // =======Задача 11.13
// false
// // =======Задача 11.14
// true
// // =======Задача 11.15
// false
// // =======Задача 11.16
// true
// // =======Задача 11.17
// false
// // =======Задача 11.18
// true
// // =======Задача 11.19
// false
// // =======Задача 11.20
// true
// // =======Задача 11.21
// true


