"use strict";

// Задача 94.1
// Реализуйте функцию getGreatestCommonDivisor, которая параметрами будет принимать два числа и возвращать НОД этих двух чисел. При решении задачи старайтесь использовать вспомогательные функции, в том числе полученные нами ранее в теоретической части.

// Не решена!

// Задача 94.1
// Положительные целые числа, не имеющие общих делителей, кроме тривиальной единицы, называются взаимно простыми. Говоря другими словами, два числа можно назвать взаимно простыми, если их НОД равен единице.

// Напишите функцию, которая параметрами будет принимать два числа и проверять - взаимно простые они или нет.

// Не решена!