"use strict";

//=======Задача 73.1
// Возведите 2 в 10 степень.
console.log(Math.pow(2, 10));

//=======Задача 73.2
// Найдите квадратный корень из 245.
console.log(Math.sqrt(245));

//=======Задача 73.3
// Дан массив с элементами 4, 2, 5, 19, 13, 0, 10. Найдите квадратный корень из суммы кубов его элементов. Для решения воспользуйтесь циклом for.
let arr = [4, 2, 5, 19, 13, 0, 10];
let count = 0;
for(let key in arr){
count = count + arr[key];
}
console.log(Math.sqrt(count));

//=======Задача 73.4

//=======Задача 73.5

//=======Задача 73.6

//=======Задача 73.7

//=======Задача 73.8

//=======Задача 73.9




