"use strict";

// // =======Задача 2.1
// // let num;
// // num = 123;
// // alert(num);
// // =======Задача 2.2
// // let a = 1;
// // let b = 2;
// // let c = 3;

// // let a = 1, b = 2; c = 3;

// // let a, b, c;
// // a = 1;
// // b = 2;
// // c = 3;
// // =======Задача 2.3
// // let a;
// // a = 10;
// // alert(20);
// // a = 20;
// // alert(a);
// // =======Задача 3.1
// // let a = 1+2+3;
// // alert(a);
// // =======Задача 3.2
// // alert(1+2+3);
// // =======Задача 3.3
// // let a = 10, b = 2;
// // alert(a+b);
// // alert(a-b);
// // alert(a*b);
// // alert(a/b);
// // =======Задача 3.4
// // let c = 10, d = 5;
// // let result = c + d;
// // alert(result);
// // =======Задача 3.5
// // let a = 1, b = 2, c = 3;
// // alert(a+b+c);
// // =======Задача 3.6
// // let a = 10, b = 5;
// // let c = a-b;
// // let d = 7;
// // let result = c+d;
// // alert(result);
// // =======Задача 3.7
// // 20
// // =======Задача 3.8
// // 23
// // =======Задача 3.9
// // 6
// // =======Задача 3.10
// // 9
// // =======Задача 3.11
// // 8
// // =======Задача 3.12
// // 8
// // =======Задача 3.13
// // 25
// // =======Задача 3.14
// // 13
// // =======Задача 3.15
// // 36
// // =======Задача 3.16
// // 4
// // =======Задача 3.17
// // 4
// // =======Задача 3.18
// // 4
// // =======Задача 3.19
// // let a = 1.5, b = 0.75;
// // alert(a+b);
// // =======Задача 3.20
// // let a = -100;
// // alert(a);
// // =======Задача 3.21
// // let a = 200;
// // alert(-a);
// // =======Задача 3.22
// // let a = 10, b = 3;
// // alert(a % b);
// // =======Задача 3.23
// // alert(2**10);
// // =======Задача 3.24
// // 24
// // =======Задача 3.25
// // 216
// // =======Задача 3.26
// // 48
// // =======Задача 3.27
// // 24
// // =======Задача 3.28
// // 72
// // =========ПРОВЕРЕНО ВВЕРХУ========ПРОВЕРЕНО ВВЕРХУ=================================
// // // =======Задача 4.1
// // let str = '!!!';
// // alert(str);
// // // =======Задача 4.2
// // let str = 'java', str1 = 'script';
// // alert(str + str1);
// // // =======Задача 4.3
// // let str = 'hello', str1 = 'world';
// // alert(str + ' ' + str1);
// // // =======Задача 4.4
// // let name = 'Yaroslav';
// // alert('привет' + ' ' + name);
// // // =======Задача 4.5
// // let age = 40;
// // alert('мне ' + age + ' лет');
// // // =======Задача 4.6
// // let str = 'Yaroslav';
// // alert(str.length);
// // // =======Задача 4.7
// // let str = `a
// // b
// // c`;
// // alert(str);
// // =============НА СТАДИИ ПРОВЕРКИ ВВЕРХУ=======================================
// // // =======Задача 5.1
// // let a;
// // alert(a);
// // // // =======Задача 5.2
// // let a = 0;
// // alert(a);
// // // // =======Задача 5.3
// // let a = true;
// // alert(a);
// // // // =======Задача 5.4
// // let a = false;
// // alert(a);
// // // // =======Задача 5.5
// // let str = 'Hi';
// // let str1 = 'Everybady';
// // alert(str * str1);
// // // // =======Задача 5.6
// // alert(10/0);
// // // // =======Задача 5.7
// // alert(-10/0);
// // // // =======Задача 5.8
// // ============НЕ ПРОВЕРЕНО ВВЕРХУ====================================================================
//  // =======Задача 7.1
// alert(60*60*24);
// // =======Задача 7.2
// alert(60*60*24*30);
// // =======Задача 7.3
// alert(60*60*24*365);
// // =======Задача 7.4
// alert(60*24);
// // =======Задача 7.5
// alert(60*24*365);
// // =======Задача 7.6
// 1048576 байт
// // =======Задача 7.7
// 1073741824 байт
// // =======Задача 7.8
// 10737418240 байт
// // =======Задача 7.9
// 109951162777 байт
// // =======Задача 7.10
// 1073741824 килобайт
// // =======Задача 7.11
// let r = 20;
// let s = r * r * 3.1415;
// alert(s);
// // =======Задача 7.12
// let a = 35;
// let s = a * a;
// alert(s);
// // =======Задача 7.13
// let a = 20;
// let b = 30;
// let s = a * b;
// alert(s);
// // =======Задача 7.14
// let a = 50;
// let b = 60;
// alert(p = 2*(a + b));
// // =======Задача 7.15
// let tc = 36;
// alert(tc*1.8+32);
// // =======Задача 7.16
// let tf = 200;
// alert((tf-32)/1.8);

